[
    {"version": "v1.9.2",
     "date": "2024-12-04",
     "notes": ["Change in heatmap data file formatting requirements: the gene_id column is no longer required. For backwards compatibility, gene_id columns in uploaded heatmap files will now be ignored.", "Major bug fix for heatmap cell colours and the minimum, average, and maximum values of the heatmap being potentially incorrect if the heatmap file contains data for isoforms of the currently visualized gene that are absent from the uploaded stack file.", "Major bug fix for not adding 1 to the average value of isoform heatmap data before taking its log transform.", "When all other Ensembl isoforms of a gene are loaded, show known ORFs when the 'User ORFs' stack option is enabled instead of the entirety of isoforms as ORFs.", "Alpha feature: IsoVis can now visualize the locations of identified m6A modification sites and their associated modification levels. Refer to the 'Help on upload data' page for details on file formatting."]},

    {"version": "v1.9.1",
     "date": "2024-11-21",
     "notes": ["The definition of constitutive junctions is changed to be those that are present in all transcripts that fully cover them by their transcription start and end sites.", "Bug fix for the genomic range of the isoform stack not always expanding to fully show the genomic range covered by all other Ensembl isoforms when they are loaded by the user.", "The splice differences graph, the genomic range covered by the isoform stack, and the exonic regions will now be recalculated according to the visibility of all other Ensembl isoforms.", "The gene strand diagram will now show a warning if there is a mismatch between the gene strandedness from user stack data and from Ensembl.", "Minor bug fix for occasionally missing gene strand ticks."]},

    {"version": "v1.9",
     "date": "2024-11-15",
     "notes": ["Preliminary support for showing splicing differences added: Can display junctions that are not present in all isoforms (work in progress).", "Beta feature: Can now show ORFs from uploaded stack data. Please refer to the updated 'Help on upload data' page for the expected format of ORF information in isoform data files.", "Minor speed improvement in fetching transcript ORFs.", "The demo data visualization and demo data files have been updated to demonstrate user ORFs."]},

    {"version": "v1.8",
     "date": "2024-05-12",
     "notes": ["Beta feature: Can now load other Ensembl isoforms that are not present in the uploaded stack data.", "Minor bug fix for protein feature mappings.", "The default font size of text for the protein labels, gene strand diagram and heatmap legend is increased.", "Reduced visual cluttering in exported images.", "Protein diagram pop-ups should now always float on top of the buttons above the diagram."]},

    {"version": "v1.7",
     "date": "2024-03-24",
     "notes": ["Labels for protein domains can now be shown atop the protein diagram (work in progress).", "A colour legend has been added for the protein diagram.", "The RefSeq accession of the canonical isoform is now displayed if it exists. It would link to a GenBank entry on the canonical isoform.", "Added support for BED4 to BED9 stack data files.", "Image export functionality has been completely rewritten. Added support for exporting scalable SVG and PDFs.", "Hovering over an exon in the isoform stack now shows its exon number, exonic region number, genomic coordinate range and which transcript it is from.", "Users can now specify whether their stack data files use the GRCh37 (hg19) genome build instead of GRCh38 (hg38) when uploading data.", "The 'Known ORFs' stack option is now automatically hidden if no known ORFs could be loaded for the isoform stack.", "Updated demo data archives to include a BED6 stack file example, a BED12 stack file example, and a 'readme' text file."]},

    {"version": "v1.6",
     "date": "2024-01-28",
     "notes": ["Support for isoform sorting added: Can sort by transcript symbol / ID or by mean heatmap values.", "Home page is revamped.", "A tutorial page on how to use IsoVis has replaced the tutorial video."]},

    {"version": "v1.5.1",
     "date": "2024-01-15",
     "notes": ["Matching gene IDs from mygene.info with those from the stack file is now case-insensitive.", "The checking of 'gene_id' and 'transcript_id' heatmap column names is now case-insensitive.", "Filtering for relevant genes and transcripts to visualize from the heatmap file is now case-insensitive.", "Minor bug fixes."]},

    {"version": "v1.5",
     "date": "2023-12-20",
     "notes": ["IsoVis is now open-source. Its source code can be accessed via its GitHub repository.", "A tutorial video on how to use IsoVis is now available.", "Support for different species is improved.", "Size limit for uploading stack files and heatmap files is increased from 1 GB to 2 GB.", "Demo data and Clark Lab data are now available for download.", "Several bug fixes."]},

    {"version": "v1.4",
     "date": "2023-11-30",
     "notes": ["Support for different species added: Can select which species the stack data came from.", "Zoom function for isoform stack added.", "Gene strand diagram is now more informative.", "Pfam protein domains now use a more colourblind-friendly colour.", "Size limit for uploading stack files and heatmap files is increased from 200 MB to 1 GB."]},

    {"version": "v1.3",
     "date": "2023-10-06",
     "notes": ["Stack crosshair added: Shows the genomic location of the cursor when hovered over the canonical transcript, isoform stack or gene strand.", "Improved multi-gene search.", "Performance improvement in processing uploaded data files.", "Several bug fixes."]},

    {"version": "v1.2",
     "date": "2023-09-07",
     "notes": ["Numerous bug fixes.", "Multi-gene support added: Can switch between genes to visualize in the uploaded data.", "Can now add a heatmap if only stack data were uploaded.", "Isoforms in the stack can now be dragged and reordered, or removed and added back in.", "Significant performance improvements in site rendering and image export.", "Image export now supports SVG (work in progress) and JPEG."]},

    {"version": "v1.1.1",
     "date": "2023-07-24",
     "notes": ["Isoform stack is widened.", "Heatmap is now colourblind-friendly.", "Log-transform button added to heatmap.", "Can toggle stack and heatmap.", "Can clear uploaded data."]},

    {"version": "v1.1",
     "date": "2023-04-03",
     "notes": ["Major update with new layouts and pages and backend design."]},

    {"version": "v1.0",
     "date": "2021-09-06",
     "notes": ["First release."]}
]